src/cf/InformationRegisters/УправлениеЗапасами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УправлениеЗапасами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МинимальныйУровеньЗапаса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйУровеньЗапаса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/УправлениеЗапасами/Forms/ор_ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") Тогда
		
		Номенклатура = Параметры.Отбор.Номенклатура;
		
		Если НЕ Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Управление запасами используется только для запасов'");
			Элементы.Список.ТолькоПросмотр = Истина;
			
		// Наборы
		ИначеЕсли Номенклатура.ЭтоНабор Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Управление запасами недоступно для наборов'");
			Элементы.Список.ТолькоПросмотр = Истина;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ВыборТолькоСклада") Тогда
		ВыборТолькоСклада = Параметры.ВыборТолькоСклада;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтраслевыеПроцедурыИФункции

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	Оповестить("ИзменениеРегистраМинимальныхОстатков");
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", Новый Структура("Номенклатура", Номенклатура));
	ПараметрыОткрытия.Вставить("ВыборТолькоСклада", ВыборТолькоСклада);
	
	ОткрытьФорму("РегистрСведений.УправлениеЗапасами.ФормаЗаписи", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Ключ = ПолучитьКлючЗаписиРегистраСведений(
		ТекДанные.Организация,
		ТекДанные.Склад,
		ТекДанные.Номенклатура,
		ТекДанные.Характеристика);
		
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", Ключ);
	ПараметрыФормы.Вставить("ВыборТолькоСклада", ВыборТолькоСклада);
	
	ОткрытьФорму("РегистрСведений.УправлениеЗапасами.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

Функция ПолучитьКлючЗаписиРегистраСведений(Организация, Склад, Номенклатура, Характеристика)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", 	Организация);
	Отбор.Вставить("Склад", 		Склад);
	Отбор.Вставить("Номенклатура", 	Номенклатура);
	Отбор.Вставить("Характеристика",Характеристика);
	
	Возврат РегистрыСведений.УправлениеЗапасами.СоздатьКлючЗаписи(Отбор);
	
КонецФункции

#КонецОбласти
